app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 2)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
DELETE FROM "movies" WHERE "id" = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy